In [55]:
import pandas as pd

In [56]:
df1=pd.read_csv('supermarkets.csv')
df1.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [57]:
df2=pd.read_json('supermarkets.json')
df2.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [58]:
df3=pd.read_csv('supermarkets-commas.txt',sep=',')
df3.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [59]:
df4=pd.read_csv('supermarkets-semi-colons.txt',sep=';')
df4.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [60]:
df5=pd.read_excel('supermarkets.xlsx',sheet_name=0)
df5.head()

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [61]:
#indexing in pandas
df4.loc[:,'Address':'State']

           Address           City             State
0     3666 21st St  San Francisco          CA 94114
1   735 Dolores St  San Francisco          CA 94119
2      332 Hill St  San Francisco  California 94114
3     3995 23rd St  San Francisco          CA 94114
4  1056 Sanchez St  San Francisco        California
5  551 Alvarado St  San Francisco          CA 94114

In [62]:
#Same operation can be performed using iloc
df2.iloc[:,1:4]

           Address           City             State
0     3666 21st St  San Francisco          CA 94114
1   735 Dolores St  San Francisco          CA 94119
2      332 Hill St  San Francisco  California 94114
3     3995 23rd St  San Francisco          CA 94114
4  1056 Sanchez St  San Francisco        California
5  551 Alvarado St  San Francisco          CA 94114

In [63]:
#now we will perform merge which is similar to join operation in sql

dataset=pd.merge(left=df4,right=df5,on='ID')
dataset.head()

,ID,Address_x,City_x,State_x,Country_x,Name,Employees,Address_y,City_y,State_y,Country_y,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [64]:
#Now we will perform geocoding or find latitude and longitude from address
from geopy.geocoders import ArcGIS
address_finder=ArcGIS()

In [65]:
#Demonstrations of geocoding
address_finder.geocode('3666 21st St,San Francisco,CA 94114,USA')

Location(3666 21st St, San Francisco, California, 94114, (37.756648011392286, -122.42937496976432, 0.0))

In [66]:
information=pd.read_json('Supermarkets.json')
information.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [67]:
information['full_address']=information.Address+','+information.City+','+information.State+','+information.Country
information.head()

,ID,Address,City,State,Country,Name,Employees,full_address
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,"3666 21st St,San Francisco,CA 94114,USA"
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,"735 Dolores St,San Francisco,CA 94119,USA"
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,"332 Hill St,San Francisco,California 94114,USA"
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,"3995 23rd St,San Francisco,CA 94114,USA"
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,"1056 Sanchez St,San Francisco,California,USA"

In [68]:
#Creating new column full address
information['Full_address']=information.Address+','+information.City+','+information.State+','+information.Country
information.head()

,ID,Address,City,State,Country,Name,Employees,full_address,Full_address
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,"3666 21st St,San Francisco,CA 94114,USA","3666 21st St,San Francisco,CA 94114,USA"
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,"735 Dolores St,San Francisco,CA 94119,USA","735 Dolores St,San Francisco,CA 94119,USA"
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,"332 Hill St,San Francisco,California 94114,USA","332 Hill St,San Francisco,California 94114,USA"
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,"3995 23rd St,San Francisco,CA 94114,USA","3995 23rd St,San Francisco,CA 94114,USA"
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,"1056 Sanchez St,San Francisco,California,USA","1056 Sanchez St,San Francisco,California,USA"

In [69]:
#Dropping column
information.drop(columns='full_address')

,ID,Address,City,State,Country,Name,Employees,Full_address
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,"3666 21st St,San Francisco,CA 94114,USA"
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,"735 Dolores St,San Francisco,CA 94119,USA"
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,"332 Hill St,San Francisco,California 94114,USA"
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,"3995 23rd St,San Francisco,CA 94114,USA"
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,"1056 Sanchez St,San Francisco,California,USA"
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,"551 Alvarado St,San Francisco,CA 94114,USA"

In [88]:
geo_temp=information['Full_address'].apply(address_finder.geocode)
geo_temp

0    (3666 21st St, San Francisco, California, 9411...
1    (735 Dolores St, San Francisco, California, 94...
2    (332 Hill St, San Francisco, California, 94114...
3    (3995 23rd St, San Francisco, California, 9411...
4    (1056 Sanchez St, San Francisco, California, 9...
5    (551 Alvarado St, San Francisco, California, 9...
Name: Full_address, dtype: object

In [95]:
sizer=geo_temp.size

In [101]:
lat=[]
for i in range(sizer):
    lat.append(geo_temp[i].latitude)

In [102]:
long=[]
for i in range(sizer):
    long.append(geo_temp[i].longitude)

In [105]:
information['Latitude']=lat
information.head()

,ID,Address,City,State,Country,Name,Employees,full_address,Full_address,Latitude
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,"3666 21st St,San Francisco,CA 94114,USA","3666 21st St,San Francisco,CA 94114,USA",37.756648
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,"735 Dolores St,San Francisco,CA 94119,USA","735 Dolores St,San Francisco,CA 94119,USA",37.757819
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,"332 Hill St,San Francisco,California 94114,USA","332 Hill St,San Francisco,California 94114,USA",37.755875
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,"3995 23rd St,San Francisco,CA 94114,USA","3995 23rd St,San Francisco,CA 94114,USA",37.752922
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,"1056 Sanchez St,San Francisco,California,USA","1056 Sanchez St,San Francisco,California,USA",37.752131

In [106]:
information['Longitude']=long
information.head()

,ID,Address,City,State,Country,Name,Employees,full_address,Full_address,Latitude,Longitude
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,"3666 21st St,San Francisco,CA 94114,USA","3666 21st St,San Francisco,CA 94114,USA",37.756648,-122.429375
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,"735 Dolores St,San Francisco,CA 94119,USA","735 Dolores St,San Francisco,CA 94119,USA",37.757819,-122.425337
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,"332 Hill St,San Francisco,California 94114,USA","332 Hill St,San Francisco,California 94114,USA",37.755875,-122.428816
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,"3995 23rd St,San Francisco,CA 94114,USA","3995 23rd St,San Francisco,CA 94114,USA",37.752922,-122.431697
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,"1056 Sanchez St,San Francisco,California,USA","1056 Sanchez St,San Francisco,California,USA",37.752131,-122.430028